Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ4010CA80208.atdf
        <register name="ERROR" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Error Interrupt Flag">
          <bitfield name="BERR" caption="AHB Bus Error Detection" mask="0x1"/>
        </register>
      </register-group>
      <register-group name="CAN_RXBE" caption="Rx Buffer Element" aligned="4">
        <register name="CAN_RXBE_0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer and FIFO Element 0">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_RXBE_1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer and FIFO Element 1">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0xFFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0xF0000"/>
          <bitfield name="BRS" caption="Bit Rate Search" mask="0x100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x200000"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000"/>
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000"/>
        </register>
        <register name="CAN_RXBE_DATA" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000" caption="Rx Buffer and FIFO Element Data">
          <bitfield name="DB0" caption="Data Byte 0" mask="0xFF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0xFF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0xFF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_RXF0E" caption="Rx FIFO 0 Element" aligned="4">
        <register name="CAN_RXF0E_0" caption="Rx FIFO 0 Element 0" offset="0x0" rw="RW" size="4">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF0E_1" caption="Rx FIFO 0 Element 1" offset="0x4" rw="RW" size="4">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0x0000FFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000"/>
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF0E_DATA" caption="Rx FIFO 0 Element Data" offset="0x8" rw="RW" size="4">
          <bitfield name="DB0" caption="Data Byte 0" mask="0x000000FF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0x0000FF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0x00FF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_RXF1E" caption="Rx FIFO 1 Element" aligned="4">
        <register name="CAN_RXF1E_0" caption="Rx FIFO 1 Element 0" offset="0x0" rw="RW" size="4">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF1E_1" caption="Rx FIFO 1 Element 1" offset="0x4" rw="RW" size="4">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0x0000FFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0x000F0000"/>
          <bitfield name="BRS" caption="Bit Rate Switch" mask="0x00100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x00200000"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000"/>
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000"/>
        </register>
        <register name="CAN_RXF1E_DATA" caption="Rx FIFO 1 Element Data" offset="0x8" rw="RW" size="4">
          <bitfield name="DB0" caption="Data Byte 0" mask="0x000000FF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0x0000FF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0x00FF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_SIDFE" caption="Standard Message ID Filter Element" aligned="4">
        <register name="CAN_SIDFE_0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Standard Message ID Filter Element">
          <bitfield name="SFID2" caption="Standard Filter ID 2" mask="0x7FF"/>
          <bitfield name="SFID1" caption="Standard Filter ID 1" mask="0x7FF0000"/>
          <bitfield name="SFEC" caption="Standard Filter Element Configuration" mask="0x38000000" values="CAN_SIDFE_0__SFEC"/>
          <bitfield name="SFT" caption="Standard Filter Type" mask="0xC0000000" values="CAN_SIDFE_0__SFT"/>
        </register>
      </register-group>
      <register-group name="CAN_TXBE" caption="Tx Buffer Element" aligned="4">
        <register name="CAN_TXBE_0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element 0">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
